{
    "questions": [
      {
        "index": 0,
        "text": "What are the main types of text-based digital content?"
      },
      {
        "index": 1,
        "text": "Name two formats commonly used for interactive digital content."
      },
      {
        "index": 2,
        "text": "How can businesses use social media content to engage with their audience effectively?"
      },
      {
        "index": 3,
        "text": "Give an example of a digital content format that can be used to showcase product features and benefits."
      },
      {
        "index": 4,
        "text": "Explain how virtual and augmented reality content can enhance user experiences."
      },
      {
        "index": 5,
        "text": "Have I analyzed audience feedback and comments to identify areas for improvement and refinement in my content?"
      },
      {
        "index": 6,
        "text": "Am I regularly updating my digital content with the latest data, statistics, and industry trends to keep it relevant and valuable?"
      },
      {
        "index": 7,
        "text": "Do I leverage multimedia elements, such as images, videos, and interactive elements, to enhance the visual appeal and engagement of my content?"
      },
      {
        "index": 8,
        "text": "Have I integrated interactive elements, such as polls, quizzes, or calls-to-action, to encourage audience participation and create a more immersive experience?"
      },
      {
        "index": 9,
        "text": "Am I optimizing my digital content for search engines by using relevant keywords, meta tags, and internal linking to improve its visibility and search rankings?"
      },
      {
        "index": 10,
        "text": "Have I explored a diverse range of sources, including articles, data, images, and videos, to gather different items of content and information?"
      },
      {
        "index": 11,
        "text": "Did I identify common themes and connections among the various content items to create a cohesive narrative for the new content?"
      },
      {
        "index": 12,
        "text": "Have I added my own unique insights and perspectives to bring a fresh and original angle to the content?"
      },
      {
        "index": 13,
        "text": "Did I integrate multimedia elements, such as images, videos, and infographics, to enhance the visual appeal of the new content?"
      },
      {
        "index": 14,
        "text": "Have I incorporated interactive elements, such as polls, quizzes, or calls-to-action, to create a more engaging and participative experience for the audience?"
      },
      {
        "index": 15,
        "text": "What is GPT-3 primarily used for in content creation?"
      },
      {
        "index": 16,
        "text": "Which AI tool is known for generating visual content?"
      },
      {
        "index": 17,
        "text": "How can AI like GPT-3 enhance the content creation process?"
      },
      {
        "index": 18,
        "text": "In the context of AI-generated content, what does 'augmenting human creativity' mean?"
      },
      {
        "index": 19,
        "text": "Which type of content is NOT typically generated by AI like GPT-3 and DALL-E?"
      },
      {
        "index": 20,
        "text": "Which AI model is well-known for text generation capabilities?"
      },
      {
        "index": 21,
        "text": "What is a key consideration when using DALL-E for creating visuals?"
      },
      {
        "index": 22,
        "text": "Why is ethical reasoning important in AI-generated content?"
      },
      {
        "index": 23,
        "text": "In the context of AI-generated content, what is 'integration'?"
      },
      {
        "index": 24,
        "text": "What does an effective prompt for GPT-3 include?"
      },
      {
        "index": 25,
        "text": "What is the primary goal of fine-tuning input prompts for AI in content generation?"
      },
      {
        "index": 26,
        "text": "When editing AI-generated text, what aspect is crucial to enhance?"
      },
      {
        "index": 27,
        "text": "What is the outcome of a well-crafted AI-assisted visual portfolio?"
      },
      {
        "index": 28,
        "text": "In the context of AI-generated content, what does 'interactive multimedia presentation' refer to?"
      },
      {
        "index": 29,
        "text": "What skill does critically editing AI-generated output test?"
      },
      {
        "index": 30,
        "text": "What is the primary purpose of accessibility incorporation in digital content?"
      },
      {
        "index": 31,
        "text": "Which of the four key principles of accessible design emphasizes the need for users to be able to operate user interfaces and navigate content using a variety of input methods?"
      },
      {
        "index": 32,
        "text": "Which of the following is a recommended practice for ensuring that digital content is compatible with a wide range of assistive technologies: testing your content with a variety of assistive technologies, using an editor to create your content, avoiding using complex code or plugins, previewing your content in different browsers?"
      },
      {
        "index": 33,
        "text": "What is the primary purpose of alternative text for images?"
      },
      {
        "index": 34,
        "text": "Which of the following colour contrast ratios is recommended for text and background to ensure readability for users with low vision: 4.5:1, 1:1, 2:1 or 7:1?"
      },
      {
        "index": 35,
        "text": "When modifying form inputs to be more accessible, what is a crucial feature to add?"
      },
      {
        "index": 36,
        "text": "What kind of testing is important after implementing new accessibility features?"
      },
      {
        "index": 37,
        "text": "Why are alternative texts for images important?"
      },
      {
        "index": 38,
        "text": "Which can be a necessary step to optimize digital content for accessibility compliance: to use accessibility tools and resources, to improve the hardware structure of the dedicate computer, to enhance the visual appeal of digital content, to increase the user engagement of digital content?"
      },
      {
        "index": 39,
        "text": "Which of the following tools is commonly used for conducting accessibility audits of digital content: WAVE Evaluation Tool, Google Analytics, Microsoft Powerpoint, Microsoft Word?"
      },
      {
        "index": 40,
        "text": "Which of the following is the primary objective of applying user-centered design principles throughout the development of an accessible prototype: to ensure that the prototype is accessible to users with disabilities from the outset, to create a visually appealing and aesthetically pleasing prototype, to minimize development time and costs by prioritizing accessibility considerations later, to comply with accessibility regulations and avoid potential legal liabilities?"
      },
      {
        "index": 41,
        "text": "How can emerging tools and technologies, such as AI-powered tools, adaptive design features, and personalized accessibility options, enhance the accessibility of a digital prototype?"
      },
      {
        "index": 42,
        "text": "What is the role of incorporating innovative accessibility solutions for multimedia elements in a digital prototype?"
      },
      {
        "index": 43,
        "text": "What can be the main purpose for following the principles of inclusive design?"
      },
      {
        "index": 44,
        "text": "Which innovative methods are emerging to make multimedia content accessible to a wider audience?"
      },
      {
        "index": 45,
        "text": "What are the three VR headsets you chose to research?"
      },
      {
        "index": 46,
        "text": "What are some of the factors to consider when choosing a VR headset?"
      },
      {
        "index": 47,
        "text": "What are some of the latest trends in VR headset development?"
      },
      {
        "index": 48,
        "text": "What is your overall impression of the VR headset market and its future potential?"
      },
      {
        "index": 49,
        "text": "What is one of the key challenges that VR headset manufacturers face in terms of increasing the field of view (FOV) of their devices?"
      },
      {
        "index": 50,
        "text": "Which of the following is NOT an example of modifying a VR, AR, or MR experience: Integrating two or more experiences, Removing features, Changing the difficulty, Adding new features?"
      },
      {
        "index": 51,
        "text": "What is the most important thing to consider when modifying a VR, AR, or MR experience?"
      },
      {
        "index": 52,
        "text": "Which of the following is NOT an example of refining a VR, AR, or MR experience: Adding new content, Making the controls more responsive, Improving the graphics quality, Fixing minor bugs?"
      },
      {
        "index": 53,
        "text": "What is the most important thing to consider when refining a VR, AR, or MR experience?"
      },
      {
        "index": 54,
        "text": "Which of the following is NOT an example of improving a VR, AR, or MR experience?"
      },
      {
        "index": 55,
        "text": "Which tool is commonly used for developing Virtual Reality experiences?"
      },
      {
        "index": 56,
        "text": "Which of the following best describes Mixed Reality (MR): Combines elements of both VR and AR, Only virtual elements are used, Only real-world elements are used, Neither virtual nor real elements are used?"
      },
      {
        "index": 57,
        "text": "What is the primary component for user immersion in VR?"
      },
      {
        "index": 58,
        "text": "What ethical aspect is crucial in VR/AR/MR development?"
      },
      {
        "index": 59,
        "text": "Which language is commonly used for VR programming?"
      },
      {
        "index": 60,
        "text": "What is digital content?"
      },
      {
        "index": 61,
        "text": "Where can digital content be accessed?"
      },
      {
        "index": 62,
        "text": "What should be considered when creating and sharing digital content?"
      },
      {
        "index": 63,
        "text": "What is the purpose of word processing software?"
      },
      {
        "index": 64,
        "text": "What is the purpose of video editing software?"
      },
      {
        "index": 65,
        "text": "What are the benefits of cross-platform integration for digital content?"
      },
      {
        "index": 66,
        "text": "What are the three tips for implementing cross-platform integration techniques for digital content?"
      },
      {
        "index": 67,
        "text": "What are the three key performance indicators (KPIs) that can help you to measure the success of your digital content?"
      },
      {
        "index": 68,
        "text": "What are analytics tools?"
      },
      {
        "index": 69,
        "text": "What is A/B testing?"
      },
      {
        "index": 70,
        "text": "What are the three tips for implementing cross-platform integration techniques for digital content?"
      },
      {
        "index": 71,
        "text": "What is innovation and originality in Digital Content Creation?"
      },
      {
        "index": 72,
        "text": "What are the most popular and versatile options for digital content creation?"
      },
      {
        "index": 73,
        "text": "What is cross-platform optimization?"
      },
      {
        "index": 74,
        "text": "What are the tips for cross-platform optimization?"
      },
      {
        "index": 75,
        "text": "Which of the following tools is primarily used for data visualization: Excel, MySQL, Git, Microsoft Word?"
      },
      {
        "index": 76,
        "text": "What is the main purpose of data visualization?"
      },
      {
        "index": 77,
        "text": "What are some popular data visualization tools?"
      },
      {
        "index": 78,
        "text": "What is data manipulation?"
      },
      {
        "index": 79,
        "text": "What does data manipulation involve?"
      },
      {
        "index": 80,
        "text": "Which of the following is NOT a common data manipulation technique: Visualizing, Transforming, Aggregating, Cleaning?"
      },
      {
        "index": 81,
        "text": "Which of the following data manipulation techniques is used to identify and correct errors and inconsistencies in data: Cleaning, Transforming, Aggregating, Merging?"
      },
      {
        "index": 82,
        "text": "Which of the following criteria is NOT important for evaluating the effectiveness of data manipulation techniques: Transparency, Completeness, Efficiency, Accuracy and consistency?"
      },
      {
        "index": 83,
        "text": "What is the first step in a data manipulation process?"
      },
      {
        "index": 84,
        "text": "What is the meaning of data cleaning?"
      },
      {
        "index": 85,
        "text": "What is the primary objective of the Data Visualization?"
      },
      {
        "index": 86,
        "text": "What are the common uses of data wrangling?"
      },
      {
        "index": 87,
        "text": "What is a key task in the Data Manipulation?"
      },
      {
        "index": 88,
        "text": "What does data wrangling, often performed in the Data Manipulation, primarily involve?"
      },
      {
        "index": 89,
        "text": "In the Data Attribution, what are students required to do?"
      },
      {
        "index": 90,
        "text": "What is the role of Search Engine Optimization (SEO)?"
      },
      {
        "index": 91,
        "text": "From the perspective of digital marketing, is SEO sufficient?"
      },
      {
        "index": 92,
        "text": "What are some Search Engine Optimization tools?"
      },
      {
        "index": 93,
        "text": "How can you identify issues such as broken links, duplicate content, and site speed problems?"
      },
      {
        "index": 94,
        "text": "Beside SEO, enumerate 2 digital marketing activities."
      },
      {
        "index": 95,
        "text": "What is the primary goal of on-page SEO optimization?"
      },
      {
        "index": 96,
        "text": "What is the primary goal of social media marketing for businesses?"
      },
      {
        "index": 97,
        "text": "What is the role of semantic search?"
      },
      {
        "index": 98,
        "text": "What is the main goal of content marketing?"
      },
      {
        "index": 99,
        "text": "Which of the following statements regarding PPC is incorrect: PPC ensures a high quality content to engage customers; PPC is a digital advertising approach in which advertisers pay a charge whenever their ad is clicked; PPC advertising can often be found on search engine results pages (SERPs); PPC is a method of purchasing new visitors for a website instead of earning them?"
      },
      {
        "index": 100,
        "text": "Which of the following is an example of an advanced SEO technique: Implementing schema markup to enhance rich snippets; Including exact match keywords in meta descriptions; Using generic anchor text for internal links; Optimizing website speed for desktop only?"
      },
      {
        "index": 101,
        "text": "What is the primary purpose of a pillar content strategy?"
      },
      {
        "index": 102,
        "text": "What is a common goal of conversion rate optimization (CRO)?"
      },
      {
        "index": 103,
        "text": "What is the primary objective of A/B testing in digital marketing?"
      },
      {
        "index": 104,
        "text": "Which type of analytics tool is commonly used for tracking website traffic and user behaviour: Google Analytics, Photoshop, SEMrush or Microsoft Excel?"
      },
      {
        "index": 105,
        "text": "Which of the following content is protected by copyright: Original and fixed work; Names, titles, slogans, and short phrases; Ideas, methods, processes, and concepts; All types of content, as long as they’re made through 'works made for hire'?"
      },
      {
        "index": 106,
        "text": "What is the purpose of copyright law?"
      },
      {
        "index": 107,
        "text": "What represents an original work?"
      },
      {
        "index": 108,
        "text": "Under which circumstances does a content creator not need permission of the copyright owner to use copyrighted material?"
      },
      {
        "index": 109,
        "text": "What must be done for copyright to have power in the legal system?"
      },
      {
        "index": 110,
        "text": "What type of intellectual property is copyright?"
      },
      {
        "index": 111,
        "text": "How does copyright differ from a trademark?"
      },
      {
        "index": 112,
        "text": "What is necessary for a work to receive copyright protection?"
      },
      {
        "index": 113,
        "text": "What is the importance of registering a copyright?"
      },
      {
        "index": 114,
        "text": "In the event of copyright infringement, what is advisable to do?"
      },
      {
        "index": 115,
        "text": "What is the primary focus of copyright ethics?"
      },
      {
        "index": 116,
        "text": "What is fundamental to copyright ethics?"
      },
      {
        "index": 117,
        "text": "According to the United States Copyright Act of 1976, which of the following is NOT one of the factors to consider when determining fair use: How the usage affects the copyright-protected work's value or prospective market; Goal and character of the usage; Nature of the copyright-protected work; Time period since publication?"
      },
      {
        "index": 118,
        "text": "If you create a piece of work at school, who usually owns the copyright?"
      },
      {
        "index": 119,
        "text": "If you paint a mural on a classroom wall as an assignment for your art class, who owns the copyright?"
      },
      {
        "index": 120,
        "text": "What is the primary purpose of licensing in the context of digital content?"
      },
      {
        "index": 121,
        "text": "What is a licensee in the context of licensing agreements?"
      },
      {
        "index": 122,
        "text": "If you gain access to the source code of a software product, are you free to use it any way you want?"
      },
      {
        "index": 123,
        "text": "Which type of licensing agreement is used for exclusive ownership over creative works?"
      },
      {
        "index": 124,
        "text": "What does a termination clause in a licensing agreement specify?"
      },
      {
        "index": 125,
        "text": "How does the number of licensors and licensees impact licensing arrangements?"
      },
      {
        "index": 126,
        "text": "What is provided through licensing agreements regarding the use of the licensor's intellectual property?"
      },
      {
        "index": 127,
        "text": "What benefit does a licensee gain from entering into a licensing agreement?"
      },
      {
        "index": 128,
        "text": "What is a disadvantage of licensing agreements?"
      },
      {
        "index": 129,
        "text": "What does the term 'royalties' refer to, in licensing area?"
      },
      {
        "index": 130,
        "text": "How does cryptographic hashing contribute to the operation of a blockchain?"
      },
      {
        "index": 131,
        "text": "What components are included in each block of a blockchain?"
      },
      {
        "index": 132,
        "text": "Why are blockchain transactions irreversible?"
      },
      {
        "index": 133,
        "text": "What is the method of validating and attaching new transaction blocks?"
      },
      {
        "index": 134,
        "text": "What is the objective of smart contracts?"
      },
      {
        "index": 135,
        "text": "What does a programmer do?"
      },
      {
        "index": 136,
        "text": "What can be used as data type in programming?"
      },
      {
        "index": 137,
        "text": "What is an algorithm?"
      },
      {
        "index": 138,
        "text": "Give me an example of two popular programming languages."
      },
      {
        "index": 139,
        "text": "Name the two basic instructions used in programming."
      },
      {
        "index": 140,
        "text": "Which of the following is a data structure: Queue, Honeycomb, Block, Note?"
      },
      {
        "index": 141,
        "text": "Which one is NOT a sorting algorithm: Fire sort, Merge sort, Bubble sort, Quick sort?"
      },
      {
        "index": 142,
        "text": "Which of the following is NOT a benefit of using classes in OOP: Make code more hard to understand; Make code reusable; Make code more secure; Make code easier to distribute?"
      },
      {
        "index": 143,
        "text": "Which of the object-oriented programming advantages ensures that programmers can expand the code easily: Inheritance, Brotherhood, Copy-paste or Encapsulation?"
      },
      {
        "index": 144,
        "text": "What is a programming architecture?"
      },
      {
        "index": 145,
        "text": "What role does backend development play?"
      },
      {
        "index": 146,
        "text": "What is a content management system?"
      },
      {
        "index": 147,
        "text": "What is the database used for?"
      },
      {
        "index": 148,
        "text": "What is a web framework?"
      },
      {
        "index": 149,
        "text": "What defines a responsive design?"
      },
      {
        "index": 150,
        "text": "What is the ability of machines to perform tasks that would normally require human intelligence?"
      },
      {
        "index": 151,
        "text": "What is the name of the field of AI that focuses on developing algorithms to extract information from images and videos?"
      },
      {
        "index": 152,
        "text": "What is the most important thing to keep in mind when developing and deploying AI systems?"
      },
      {
        "index": 153,
        "text": "What is the most important thing that we need to do to ensure that AI is accessible to everyone?"
      },
      {
        "index": 154,
        "text": "What is the future of AI?"
      },
      {
        "index": 155,
        "text": "Which of the following is a type of supervised learning: Regression, Unsupervised learning, Dimensionality reduction, Reinforcement learning?"
      },
      {
        "index": 156,
        "text": "Which of the following occurs when a model learns the training data too well and is unable to generalize to new data?"
      },
      {
        "index": 157,
        "text": "What is the input for a machine learning model?"
      },
      {
        "index": 158,
        "text": "What is the output of a machine learning model?"
      },
      {
        "index": 159,
        "text": "What type of machine learning model is given labeled data?"
      },
      {
        "index": 160,
        "text": "Which of the following is NOT a type of deep learning: Random Forest Logic, Generative Adversarial Network, Recurrent Neural Network, Convolutional Neural Network?"
      },
      {
        "index": 161,
        "text": "Which of the following domains can benefit from deep learning: Medicine, Financial sector, Car industry?"
      },
      {
        "index": 162,
        "text": "Which deep learning technique is best suited for image recognition tasks?"
      },
      {
        "index": 163,
        "text": "Which deep learning technique is best suited for language interpretation tasks?"
      },
      {
        "index": 164,
        "text": "What does deep learning mean?"
      },
      {
        "index": 165,
        "text": "How can we mitigate bias in AI?"
      },
      {
        "index": 166,
        "text": "What possible consequences can bias in AI lead to?"
      },
      {
        "index": 167,
        "text": "What is the main cause of bias in AI programming?"
      },
      {
        "index": 168,
        "text": "Which of the following is NOT an example of algorithmic bias in AI: A search engine that is more likely to return results for popular websites than for less popular websites; A spam filter that is more likely to flag emails from women than from men; A resume screening algorithm that is more likely to recommend male candidates for high-paying jobs than female candidates; A facial recognition algorithm that is more accurate at identifying white people than black people?"
      },
      {
        "index": 169,
        "text": "Which can be an option to avoid bias in AI-powered decisions: have human oversight; don’t use AI to take those decisions; create a separate AI to validate the first one; only use AI for small decisions?"
      },
      {
        "index": 170,
        "text": "Which of the following is a benefit of using AI to protect privacy: AI tools can be used to develop new encryption algorithms; AI tools can be used to identify and remove personally identifiable information from data; AI tools can be used to discover data breaches in the systems?"
      },
      {
        "index": 171,
        "text": "Which of the following is NOT a type of privacy-preserving AI: Centralized learning; Differential privacy; Federated learning or Secure multi-party computation?"
      },
      {
        "index": 172,
        "text": "Which of the following is the most important thing to keep in mind when thinking about privacy in AI: Before releasing an AI product we need to prioritize the privacy elements of the system; We can leave privacy element outside the system as those aren’t mandatory; Privacy is just a module that needs to be integrated; Privacy concerns need to be addressed only when surfaced by users?"
      },
      {
        "index": 173,
        "text": "Which of the following is a challenge to implementing privacy-preserving AI: The need to educate developers and users about privacy-preserving AI; The need to develop new algorithms and techniques; The need to address the potential for trade-offs between privacy and other important goals, such as accuracy and efficiency?"
      },
      {
        "index": 174,
        "text": "What is the difference between personally identifiable information (PII) and non-personally identifiable information (non-PII)?"
      },
      {
        "index": 175,
        "text": "Which of the following answers is NOT a benefit of transparency in AI ethics: It makes AI systems more accurate; It helps to identify and mitigate ethical risks; It helps to build trust in AI; It helps to ensure that AI is used responsibly?"
      },
      {
        "index": 176,
        "text": "Which of the following answers is NOT a challenge to achieving transparency in AI ethics: AI developers are reluctant to share information about their systems; There is no general solution to solve transparency in AI; There isn’t a standard or a guideline for AI transparency; AI systems are complex and difficult to explain?"
      },
      {
        "index": 177,
        "text": "Which of the following is an example of a transparency-enhancing measure in AI ethics: Publish the technical documentation for AI models and algorithms; Provide users with access to information about the data used to train AI models; Develop tools for explainable AI?"
      },
      {
        "index": 178,
        "text": "Which of the following is NOT expected from an ethical reviewer: Approving or rejecting the AI system for release; Reviewing the AI system to detect transparency issues; Provide guidance on how to develop the AI tools; Create documentation on how the AI system can become transparent?"
      },
      {
        "index": 179,
        "text": "Which of the following is the most important thing that can be done to promote transparency in AI ethics: Hold AI programmers and their organizations accountable, Educate users on how AI systems work, Create playbooks on how AI systems can be more transparent?"
      },
      {
        "index": 180,
        "text": "Hello"
      },
      {
        "index": 181,
        "text": "Hi"
      },
      {
        "index": 182,
        "text": "Hello, how are you today?"
      },
      {
        "index": 183,
        "text": "Hi, how are you today?"
      },
      {
        "index": 184,
        "text": "I am fine"
      },
      {
        "index": 185,
        "text": "I am doing great"
      },
      {
        "index": 186,
        "text": "I am fine, how about you?"
      },
      {
        "index": 187,
        "text": "Sure"
      },
      {
        "index": 188,
        "text": "Yes"
      },
      {
        "index": 189,
        "text": "Of course"
      },
      {
        "index": 190,
        "text": "Thank you!"
      },
      {
        "index": 191,
        "text": "Goodbye!"
      },
      {
        "index": 192,
        "text": "Bye!"
      }
    ]
  }    